programmingTutorials/OFtutorial12_momentumSource/testCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application                simpleFoam;

startFrom                  startTime;

startTime                  0;

stopAt                     endTime;

endTime 400;
//endTime 1;

deltaT                     1;

writeControl               timeStep;

writeInterval 100;

purgeWrite                 1;

writeFormat                ascii;

writePrecision             6;

timePrecision			   6;

writeCompression           uncompressed;

timeFormat                 general;

runTimeModifiable          yes;

// include the custom library
libs ("libcustomActuationDiskSource.so");

functions
{
}


// ************************************************************************* //
